Revit 2027 API
MEPAnalyticalSegment.GetSubelement Method
 Gets the subelement of this segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Subelement GetSubelement(
	Document pADoc
)
Public Function GetSubelement (
	pADoc As Document
) As Subelement
public:
Subelement^ GetSubelement(
	Document^ pADoc
)
member GetSubelement :
        pADoc : Document -> Subelement
Parameters
pADoc Document
 The document of this segment.
Return Value
Subelement
 The subelement of this segment.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace